export const SPECIALITY = [
  "طب عام",
  "طب الأطفال",
  "طب الأسنان",
  "طب النساء والتوليد",
  "طب القلب",
  "طب العيون",
  "طب العظام",
  "طب الجلدية",
  "طب الأعصاب",
  "طب الكلى",
  "طب الجهاز الهضمي",
  "طب الأنف والأذن والحنجرة",
  "طب المسالك البولية",
  "طب الصدر والتنفس",
  "الطب النفسي",
  "جراحة عامة",
  "طب الطوارئ",
  "طب الغدد الصماء",
  "أمراض الدم",
  "طب الأورام",
];

export const ROLES = {
  DOCTOR: "doctor",
  PATIENT: "patient",
  PHARMACY: "pharmacy",
  ADMIN: "admin",
};

export const STATUS = {
  PENDING: "pending",
  ACTIVE: "active",
  REJECTED: "rejected",
  SUSPENDED: "suspended",
};

export const BLOOD_TYPES = [
  "A+",
  "A-",
  "B+",
  "B-",
  "AB+",
  "AB-",
  "O+",
  "O-",
  "unknown",
];

export const DAYS_OF_WEEK = [
  "saturday",
  "sunday",
  "monday",
  "tuesday",
  "wednesday",
  "thursday",
  "friday",
];

export const DRUGCATEGORIES = [
  "أدوية القلب والضغط",
  "أدوية السكري",
  "أدوية الجهاز العصبي",
  "أدوية الجهاز التنفسي",
  "أدوية الجهاز الهضمي",
  "أدوية الجلد",
  "أدوية العظام والعضلات",
  "أدوية الهرمونات",
  "أدوية الدم",
  "أدوية المناعة",
  "أدوية العيون والأذن",
  "أدوية الكلى والمسالك البولية",
  "أدوية الأورام",
];

export const ARTICLE_CATEGORIES = [
  "الصحة العامة والوقاية",
  "الأمراض والحالات الطبية",
  "الأدوية والعلاجات",
  "التغذية والحمية",
  "اللياقة والنشاط البدني",
  "الصحة النفسية",
  "صحة المرأة",
  "صحة الرجل",
  "صحة الطفل",
  "صحة كبار السن",
  "الصحة الرقمية والتقنية الطبية",
  "الأخبار والأبحاث الطبية",
  "التثقيف الطبي",
  "الصحة والجمال",
  "الام والطفل",
  "أخرى"
];